EventLogs/Catalogs/ЖРСоединения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЖРСоединения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Драйвер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательБД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

EventLogs/CommonModules/ЖРПодключение/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПодключениеADODB(ПараметрыПодключения) Экспорт
	Если ПараметрыПодключения <> Неопределено
		И ТипЗнч(ПараметрыПодключения) = Тип("СправочникСсылка.ЖРСоединения")
		И ПараметрыПодключения <> Справочники.ЖРСоединения.ПустаяСсылка() Тогда
		Если ЖРСлужебныйСервер.ЭтоWindowsСервер() Тогда
			АДОСоединение = Новый COMОбъект("ADODB.CONNECTION");
		Иначе
			ВызватьИсключение "Ошибка при создании ADODB.CONNECTION. 
			|В настоящий момент функциональность реализована только для Windows сервера";
		КонецЕсли;
		АДОСоединение.Provider = "MSDASQL.1";
		АДОСоединение.ConnectionString = СтрШаблон("Driver={%1};Server=%2;Port=%3;Database=%4;Uid=%5;Pwd=%6;
				|STMT=utf8;TrustServerCertificate=yes;Encrypt=yes;",
				ПараметрыПодключения.Драйвер,
				ПараметрыПодключения.Сервер,
				ПараметрыПодключения.Порт,
				ПараметрыПодключения.БазаДанных,
				ПараметрыПодключения.ПользовательБД,
				ПараметрыПодключения.Пароль
			);
	Иначе
		ВызватьИсключение("Для подключения необходимо передать действительное значение из справочника подключений!!",
			КатегорияОшибки.ОшибкаВнешнегоИсточникаДанных);
	КонецЕсли;
	Если АДОСоединение.State <> 1 Тогда
		Попытка
			АДОСоединение.Open();
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки;
	КонецЕсли;
	Возврат АДОСоединение;
КонецФункции


Функция ПодключениеПоУмолчанию() Экспорт
	ПараметрыПодключения = Справочники.ЖРСоединения.СоединениеПоУмолчанию();
	НовоеПодключение = ПодключениеADODB(ПараметрыПодключения);
	Возврат НовоеПодключение;
КонецФункции

#КонецОбласти
